export default [
  // {
  //   title: '',
  //   illustration: '',
  //   content: '',
  //   list: [
  //     {
  //       title: '',
  //       content: '',
  //       source: [
  //         {
  //           content: '',
  //         },
  //       ],
  //     },
  //   ],
  // },
  {
    title: '申氏（申小屯）宗亲辛丑修谱序',
    content:
      '大凡木必有本，枝叶由此而生。水必有源，派流由此而注。人必有祖，子孙由此而诞。家之有谱，犹国之有史。史所以纪一国之事迹，谱所以叙世代之源流。盖祖宗以一人之身，散而传之千百人之身；且四方错落，有见面莫相识，尊卑莫能辨者；虽一本之亲，几犹以秦越视之。家谱之修，上以敬祖，下以收族。昭穆绘图，宗列其序。由本支而溯，一望始源，此涣而受之以萃之义也。\n\n稽申氏之根，乃中华炎帝脉系之一，得姓于商末伯夷，自古即为名门。申姓发祥于今河南南阳一带，后因战乱，渐次分布于晋、陕、冀、楚多地。至明洪武年间，山西申姓作为洪洞大槐树迁民姓氏之中，“一锅摔八瓣”，即被后世称为“打锅申”者，被分迁于今山东、北京、天津等地。冠县申小屯申氏即“打锅申”之一脉，此时随迁来冠，落足之地，初为小屯，盖因申氏之旺，故定名曰申小屯。自始祖廷方，定名二子曰尽仁、尽义，即秉持“中正做人，敦厚传家，勤俭兴业，忍让处世”，代代有承继，且不断发扬光大，遂成“孝敬父母，尊崇长龄。兄弟姐妹，坦诚相待。夫妻恩爱，相敬如宾。教育后代，不可轻率。亲族邻里，与人为善。真诚交友，取长补短”之良好之家训家风。逮至九世孙佩玉公移居郭胡疃村，子孙相荫，已成脉系，至今有200余众，亦皆共承祖教，不敢稍怠。时至十三世孙耀成迁居贾镇丁庄，已有19人；及至十三世孙耀洲徙迁本镇小张庄，现有15人。故历经700余载，更朝换代，战乱频生，依然生齿日繁，支派愈盛，在世人口总达1200余人，安家立业，各得其所。\n\n自今顺而推之，溯其流一十九世。所以联属族人，皆有修谱者，且分藏于家族各大分支，使得父兄宗族俨在庭帏，长幼尊卑秩然不紊。天地生物人为贵。曷贵乎尔？以其具天秩之彝伦，有以水源木根之本念，凛凛然统族属而不昧厥初也。夫祖宗往矣，而若子若孙若曾玄以下，皆一脉之留贻！故尊祖者不可不敬宗，敬宗者不可不收族。诚哉老泉之言曰：情见乎亲，亲尽则情尽如途人也。吾所相视如途人者，其初兄弟也；兄弟其初一人之身也。分而至于途人者，势也。势无如之何也，幸未至于途人也。使之无至于忽忘焉，可也。噫！人各有心，未有闻老泉之言而孝悌之心不油然以生者，此申谱之所以要处也。\n\n老木高耸，见千古兴替。新居栉比，载一族风流。申氏先辈经略小屯，前踵后继，世代繁衍，源远流长。给国家社会做出了卓越贡献，造就了一大批历史人物。代有贤良，齐家报国，此不一而述也。\n\n及至近代，更是俊彩飞驰，群星争耀，至十一世孙希思公，由白衣而入太学，燕及闾里，克昌厥后，传一时之佳话。十一世孙希敬公弓马娴熟，武艺精通，修太学，应武考，虽未获武魁之选，亦有将才之能，且仗义行侠，救人患难，除暴安良，亦当时之豪英。十一世孙希孔公秉处世以忍让，教子以义方，寒士而入太学，堪为素丝羔羊之谓也！十一世孙希贵公武艺高强，侠肝义胆，土匪“大刀片”袭村时，持标枪独守院门，凭一己之力，打退土匪数番进攻，挽救合村族众幸免于难。十二世孙怀彪公经营作坊，擅长武术，尤精六合之枪法，在冠县、东昌一带难逢敌手，且打破行规，广纳门徒，授艺无私，传德有望，佑护乡里，行付邦寄。弟子之东昌府聊城武校王恒玉，冠县司庞庄司延殿，分别于民国二十五、二十六年接续获全省大枪比赛季军和全省武术比赛冠军。至若抗战以来，“冠堂边委会”成立，书记肖平、县长梁向明经常趋申小屯村一带活动，村族民众自觉保护抗日政府。十三世孙耀亮、耀鹤，十五世孙相寅、相震、双印、云平诸公先后入党参军或参加抗日武装“筑先纵队”，挺身而出，置生死而度外，抗日或灭蒋，屡有建树。耀亮及双印、云平公牺牲于抗日战场。相寅公曾出任冠县抗日第五区区长。解放后，耀鹤、相震二公分别任高唐法院副院长、江西省监察委驻赣州地委监察组副组长等要职。十三世孙耀明公少岁奋勇抗日，解放初随军南下，先后在湖南、云南任职，为云南省农垦供销公司之元老，是解放后申氏家族享受厅级待遇离职休养之人。十三世孙耀江公1947年参加革命，曾任冠县团县委书记、鹤壁市体委主任等职。十三世孙耀柱公一门三杰，独树一帜，始工作于新中国之初，先后在县供销社、水利局，履职领导岗位四十余年，曾获国家水利电力部“献身水利先进个人”殊誉。长期以来，为地方水利建设做出了突出贡献，就申小屯而言，且无论是村里打井修渠，还是村民借款担贷，都尽心尽力，毫不犹豫。十四世孙景高职任冠县纪委常务副书记兼监察局长二十余年，后升迁于冠县政协副主席，退休后依出任“冠县见义勇为协会会长”，由于政绩卓著，获得各级表彰荣誉无数，“山东省优秀共产党员”、“全国纪检监察先进工作者”为最好诠释。此外，君怀德行义，扬慈施善于民，为使家乡尽快脱贫致富：无偿助力全村打农田机井、架高压线路、增设大功率变压器；组织村民、族人外出参观学习，推广油桃、蔬菜大棚种植；在积极争取上级扶持项目款的同时，率先垂范，带头捐款，先后两次修筑本村一纵二横柏油路、水泥路；对考入大学之学子进行经济帮扶。诸般善举，义动乡里，碑留民心。十五世孙相坤为建国后首位大学生，一直从事外交工作，职任驻外使馆一秘。十五世孙相峰1963年参军，任沈阳军区政治部副主任，1997年授少将军衔，为申氏首位将军，1998年参加指挥黑龙江地区抗洪救灾。\n\n在商业领域亦有杰出人才，十六世孙海泽1996年大学毕业，旋即于深圳创业，时已任“河源邮码港科技有限公司董事长”，且获得高级管理人员工商管理硕士学位。\n\n诸如各行各业，均涌现出甚多拔尖人物，可谓不胜枚举。\n\n穿时空星移斗转，逢盛世民富国强。今日申小屯，继往布新，开拓进取。改革开放春风催万物，科学发展村民奔小康。政策时雨润千家，电脑汽车随从人。广野秀景生桃李百果，沃田厚土育福禄满堂。大棚菜外运，昼日车流不息，水泥路街道，夜晚灯火辉煌，村容整洁、庭院优美、五谷丰登、百业兴旺，虽属村庄之界，不亚市井之壤，与时俱进，阔步新征程，富裕且和谐秀美，古朴且韵雅流芳。人物、历史、德行、善举、传统、创新，共同构筑起新时代合奏曲，彰显着申氏村庄历史久远、人文兴盛。成为点悟众生，净化心灵，积极向上之申氏精神财富，启来者于征途，织梦想于无穷。\n\n此次修谱，乃新中国成立后之首次，为从政者景高之倡导。庚辰起思，苦一直未寻得同谋操作之人，故常为修谱抱憾。直至岁次辛丑春末，时任村支书十五世孙相坡告知，于东昌府经商者十四世孙景军亦有修谱之念，二人相约商议，一拍即合，遂由景高君统筹谋划、组织担纲，景军君承担搜集整理材料，旁证博取，翻检遗稿文献，查阅老谱旧牒，集结口碑史料，栉风沐雨，奔波颠沛，实属不易。今之修谱，虽建国前悉尊旧事，然其后倾尽记叙，姑就所知所闻，凡祖宗之行述、事迹、名号、爵秩与历代墓所、祭产及生忌年月之可以查考者，均叙纂大略，剞劂枣梨，传为家乘。但犹恐千虑有疏，编委诸君委笔者拜言合族兄弟子侄及后世子孙共同斟酌体量焉。诗曰:“永言孝思，孝思维则”，是谱也，足显其叔孙穆子“立德立功立言不朽”之明效，不托诸空言，皆取证于申氏勋谱之成矣。追踪寻迹，有功于前者堪追；续古延今，彰美于后者必溯。斯既往之略表，俟开来之再增。',
    source: [
      {
        content: '辛丑七月，\n三善斋主、聊城作家协会顾问、中华诗词学会会员、中国散文学会会员\n高福林拜撰',
      },
    ],
  },
  {
    title: '申氏宗亲会成员',
    list: [
      {
        title: '顾问：',
        content: '申耀龙 申耀之',
      },
      {
        title: '名誉会长：',
        content: '申景高',
      },
      {
        title: '会长：',
        content: '申相坡',
      },
      {
        title: '副会长：',
        content: '申景军（申小屯）\n申书桥（申墨军）',
      },
      {
        title: '理事：（以辈分、长幼为序）',
        content:
          '申爱华 申景宪\n申相春 申相松\n申贵银（郭胡疃）\n申贵民（郭胡疃）\n申海军 申海臣\n申学献 申大勇',
      },
    ],
  },
  {
    title: '申姓始祖',
    list: [
      {
        image:
          'https://636c-cloud1-2glsmv54208d242b-1311412316.tcb.qcloud.la/image/family-tree-shen/%E7%94%B3%E5%A7%93%E5%A7%8B%E7%A5%96.jpg?sign=7d4361a60d024bec4e4d91635b4edcf9&t=1651634517',
      },
    ],
  },
  {
    title: '申氏图腾',
    list: [
      {
        image:
          'https://636c-cloud1-2glsmv54208d242b-1311412316.tcb.qcloud.la/image/family-tree-shen/%E7%94%B3%E6%B0%8F%E5%9B%BE%E8%85%BE.png?sign=d0da5efa4847487de48432dd06048bf6&t=1651634557',
        content: '释义：申的本义是雷电，古文定义申为神，在甲骨文中，申字像云气缭绕、闪电隐显之状。',
      },
    ],
  },
  {
    title: '申氏家族烈士',
    illustration: '（以牺牲时间为序）',
    list: [
      {
        title: '一、抗日战争中',
        list: [
          {
            title: '申双印',
            content: '申双印，1921年出生，1939年参军，筑先纵队战士、班长，1939年在茌平县博平牺牲。',
          },
          {
            title: '申云平',
            content: '申云平，1908年出生，1937年参军，筑先纵队战士，1940年在冠县牺牲。',
          },
          {
            title: '申耀亮',
            content: '申耀亮，1924年出生，1942年5月参加革命，冀南军区战士，1945年在阳谷牺牲。',
          },
        ],
      },
      {
        title: '二、自卫反击战中',
        list: [
          {
            title: '申墨山',
            content: '申墨山，1965年出生，1985年在对越自卫反击战中牺牲，一等功。',
          },
        ],
      },
    ],
  },
  {
    title: '在抗日战争和解放战争中申氏家族走出的英雄',
    illustration: '（以参加革命时间为序）',
    list: [
      {
        title: '1、申相寅',
        content:
          '申相寅，曾用名申相银，1919年出生，高小文化程度，1937年参加革命工作，1939年加入中国共产党。1938年2月—1941年任第五区公所区长，解放后任北京市机械局局长，后在河南新乡党校进修学习，结业后回北京机械局任党委书记，1955年5月调到河南洛阳市农机学院任院长兼党委书记。1956年7月因病去世。',
      },
      {
        title: '2、申相震',
        content:
          '申相震，1918年10月出生，1938年参加革命工作，1939年入党，同年任申小屯村组织委员。1944年5月任四区区委书记，1945年—1946年任七区区委书记，1947年9月南下。1950年6月在中共中南局纪检处任检查员，1954年10月在地质部供应司机械科任科长，1955年3月任地质部技术装备司设备处副处长、处长，1961年1月任江西省委驻瑞金县工作组组长，1961年5月任瑞金县委书记处第二书记，1965年4月任省监察委驻赣州地委监察组副组长，1968年5月任赣州地区革委会招待所领导小组组长，1968年11月下放到瑞金县谢坊公社劳动，1969年9月任瑞金日东水库总指挥，1972年4月任瑞金县直属机关党委副书记，1973年3月任赣州地区民政局局长，1981年1月任赣州地区民政局顾问，1984年1月离休，享受厅局级待遇，1996年10月逝世。',
      },
      {
        title: '3、申耀明',
        content:
          '申耀明，1922年2月出生，1944年3月参加革命工作，1949年2月加入中国共产党。1944年3月至1949年2月在武训县第七区人民政府任秘书、助理员、科员。1949年2月在冀南支队南下中队任班长，1949年9月在湖南省安化县人民政府任民政科科员、农林科副科长，1952年3月在华南恳殖局任储运科副科长、供应处副科长、财务处副科长，1955年10月任云南省农垦局供应站科长、站长，1970年7月任云南省生产建设兵团供销站副站长，1974年3月任云南省农垦局供销站党委负责人，1980年3月任云南省农垦总局供销公司第一副经理、党委书记，1984年9月经云南省委批准享受厅局级政治生活待遇离职休养。2008年4月病故，享年86岁。',
      },
      {
        title: '4、申耀鹤',
        content:
          '申耀鹤，生于1921年8月，1944年8月加入中国共产党，1944年11月参加革命工作。1944年至1950年任冠县抗日五区粮食征收仓库主任，五区区公所民政干事、司法助理员、民政助理员，冠县政府司法科刑事审判员。1951至1952任高唐法院副院长，1953至1954任阳谷法院副院长，1954年5月至1960年4月任聊城地区行署政法办公室秘书，聊城地区中级人民法院刑事审判员、办公室副主任。1960年5月至1985年任茌平渡郎口区副书记、茌平县民政局长、统计局长、计划委员会主任、茌平拖拉机站书记蒹革委会主任、民政局领导小组副组长、县沼气办公室主任。1985年5月离休。1992年患重病，医治无效，于9月20日逝世，享年72岁。',
      },
      {
        title: '5、申耀江',
        content:
          '申耀江，1929年11月出生，1946年5月加入中国共产党，1947年1月参加革命工作，1949年7月任冠县第一届团县委书记。南下后曾任鹤壁市生产指挥部指挥长、鹤壁市体委主任，1984年12月离职休养，享受地厅级待遇。于2009年2月5日逝世，享年80岁。',
      },
    ],
  },
  {
    title: '申氏家族第一位将军',
    list: [
      {
        content:
          '申相峰，1942年12月出生，1963年12月参军入伍到沈阳军区炮兵第十一师四十三团，1964年7月1日加入中国共产党。1967年5月提干，历任排长、指导员、干事等职。1973年11月任炮兵第36团政治处主任，1976年3月任炮兵第36团政治委员。曾率全团参加唐山大地震救灾任务。1982年10月任炮兵第七师副政治委员，1984年2月任炮兵第七师政治委员，1985年9月作为第一期学员到国防大学学习，1988年8月任第39集团军政治部副主任，授大校军衔，1990年9月任第39集团军116师政治委员，1992年7月任沈阳军区后勤部政治部主任，1994年8月任沈阳军区后勤部副部长（晋升副军职），1995年7月晋升少将军衔，11月任沈阳军区后勤部副政治委员，1997年7月任沈阳军区政治部副主任（晋升正军职），1998年7月参加指挥黑龙江地区抗洪救灾。2002年12月退休。2003年至2015年任沈阳军区书画会会长。',
      },
    ],
  },
  {
    title: '申氏家族新中国成立后早期的大学生',
    illustration: '（以大学毕业时间为序）',
    list: [
      {
        title: '申相斌',
        content:
          '申相斌，1936年10月生，中共党员，大学教授，行政级别为正处级。1962年毕业于山东大学历史系，同年分配到中共中央高级党校，从事组织工作。1978年调入华北石油大学，组织石油系统各级领导的培训教育工作，一生一心执着教育事业，桃李满天下，曾多次被部、校评为先进工作者和优秀共产党员称号。工作中曾与华国锋主席、邓小平同志合影留念。2002年9月病故，享年67岁。',
      },
      {
        title: '申相坤',
        content:
          '申相坤，曾用名申相密，1938年8月出生，1954年至1957年于冠县第一中学学习，1960年毕业于聊城三中，同年考入北京外国语大学读英语和缅甸语专业，任团支部书记，1965年应中国外交部指派到缅甸仰光大学进修缅甸语，先后在外交部亚洲司和驻缅甸大使馆工作，曾任党支委、三秘、二秘和一秘。1994年到1998年在驻缅甸曼德勒总领事馆工作，任总领事兼党支部书记。他多次参加缅甸代表团访华接待工作，为华国锋主席、邓颖超副委员长、伍修权总长等领导人作过翻译。1998年12月退休后，一直居住北京，参加过外交部离退休干部歌舞队。',
      },
    ],
  },
  {
    title: '申氏家族名士',
    list: [
      {
        title: '一、收录原则',
        content:
          '1、国家工作人员副县级以上职务和享受副县级待遇的（指公务员四级调研员、卫生、教育、农、林、水等由人事部门颁发的高级职称人员）；部队副团职以上职务和相应待遇的人士。\n\n2、获得省部级以上荣誉称号、部队中获得相应荣誉称号的人士。\n\n3、经商者其公司注册资金在千万元以上的。\n\n凡符合上述原则之一者，可收录为申氏家族名士。',
      },
      {
        title: '二、名士名录（以辈分、长幼为序）',
        list: [
          {
            title: '1、申耀柱',
            content:
              '申耀柱，1929年7月出生，1950年2月参加工作，1955年4月加入中国共产党。先后在县供销系统、县水利局工作。1961年9月至1990年11月曾任县水利局副局长、调研员，行政18级。1985年12月被国家水利电力部授予“献身水利先进个人”荣誉证书。1990年12月退休后，担任县水利局老干部党支部书记，1998年县水利局老干部党支部被中共山东省委组织部、省老干局、省人事厅授予“先进退休党支部”荣誉称号。同年，他个人被县委、县政府评为“老干部先进个人”。2013年9月因病去世，享年84岁。',
          },
          {
            title: '2、申耀强',
            content:
              '申耀强，1972年9月15日出生，1991年12月入伍，1994年6月加入中国共产党，大学本科学历，学士学位，武警中校警衔。历任战士、班长、学员、排长、司务长、助理员、副指导员、指导员、司令部协理员、战勤科参谋、营房科助理员、营房科科长（副团）。2007年4月调入武警黄金第二总队。他2次荣立三等功，多次被支队、总队评为“优秀党员”、“爱兵模范”和“尊干爱兵十大标兵”。\n\n2015年1月，转业到廊坊市政府农业产业化办公室，后在廊坊市农业农村局工作，曾任科员、主任科员。',
          },
          {
            title: '3、申景高',
            content:
              '申景高，1953年7月出生，大专文化，1976年10月加入中国共产党。1967年10月参加工作，1972年5月至1974年7月在山东省轻工业学校学习。1977年5月任城关供销社副主任，1984年11月任县纪委常委、信访科长，1987年4月任县纪委副书记，1993年纪检监察机关合署后任纪委常务副书记兼监察局长，2002年12月任冠县政协党组成员、副主席，2021年2月任冠县见义勇为协会会长。系中国共产党冠县第九、十、十一、十二次代表会代表。冠县劳模协会第二届理事会副会长。\n\n他坚持做到克己奉公、任劳任怨，工作中取得一定成绩。1990年中共山东省纪委授予“全省优秀纪检干部”称号；1991年聊城地区纪委授予“全区优秀纪检干部”称号；1990年、1991年、1992年连续三年县委、县政府给予记大功奖励，上报地区行署奖励一级工资；1993年和1997年分别被地区纪委、地区监察局授予“全区优秀纪检监察干部”称号，同时纠风工作受到省政府表彰；2001年7月中共山东省委授予“全省优秀共产党员”称号；2002年1月被中央纪委、人事部、监察部联合授予“全国纪检监察先进工作者”称号，并奖励一级工资。在做好本职工作的同时，他始终不忘家乡的发展。2005年和2007年两年分别无偿为本村打百米深井6眼、架设高压线800米，并增添100KVA变压器1台；2006年10月，争取资金36.5万元修筑本村“一纵二横”柏油路2700米，结束了申小屯村没有柏油路的历史。第二年又借助修程村路的时机，争取资金4.1万元为本村前街修东西路300米；2014年10月又筹资63.1万元，为本村铺水泥路面1695米。2006年12月，为减轻村民经济负担，积极争取资金5万元，帮扶到困难村民手中。为让父老乡亲富起来，2006年6月，带领村民11人去东古城镇田马园村、斜店乡前社庄村参观学习油桃、蔬菜大棚的管理技术。他还为本村安装10件健身器材。2015年资助本村考入大学的三名学生每人1000元。',
          },
          {
            title: '4、申景军',
            content:
              '申景军，1961年3月出生，大专学历，1979年8月加入中国共产党。1977年7月在冠县兰沃公社大柳邵下乡知青，任知青队长、大队团支部副书记；1979年8月分配到县水利局，任党支部委员、团支部书记；1989年9月调入县委打击经济犯罪领导小组办公室任干事；1995年5月任县综治办副主任；1998年8月任县综治办副主任、县委政法委正局级巡视员；2003年8月任县委政法委副书记、县综治办主任；2015年任县委政法委四级调研员；2017年6月任县委政法委老干部党支部书记。系冠县第十二次党代会代表，冠县第九届、第十届政协委员。多年来，由于努力学习，履职尽责，工作中取得了一定的成绩。1995年、1996年连续被聊城地委、行署授予“全区社会治安综合治理先进个人”荣誉称号，2001年被市委宣传部、市人事局、市司法局授予“全市三五普法依法治理先进个人”荣誉称号，2003年被聊城市委、市政府授予“全市防治非典型肺炎工作先进个人”荣誉称号，2004年被省委政法委授予“全省政法调研先进工作者”荣誉称号，2011年被省社会管理综合治理委员会、省人力资源和社会保障厅评为“平安山东建设先进个人”，给予记二等功奖励。',
          },
          {
            title: '5、申强',
            content:
              '申强，1980年3月出生，2001年5月加入中国共产党，1999年7月参加工作，省委党校研究生学历，1999年至2011年4月历任冠县纪委办公室科员，监察综合室主任，县纪委常委、执法监察室主任。2011年4月至2016年12月任冠县辛集乡（镇）党委副书记、镇长。2016年12月至2021年12月任冠县兰沃乡党委书记。2021年12月至今任清水镇党委书记。2022年2月任四级调研员。2022年1月当选中共聊城市第十四次党代会代表和中共冠县第十五届委员会委员。中共冠县委员会第十四届候补委员，冠县第十四届、十五届党代表，冠县第十六届、十八届人大代表。',
          },
          {
            title: '6、申斌',
            content:
              '申斌，字海泽，号公正，1964年2月27日（农历正月十五日）出生。1986年毕业于上海对外经贸大学外贸经济系对外贸易专业，被安排到北京中国对外经济贸易部工作，研究生毕业于清华大学经济管理学院，获得高级管理人员工商管理硕士学位（EMBA）。2018年获得美国哥伦比亚大学商学院、香港大学经管学院、英国伦敦商学院三大名校工商管理硕士学位（MBA）。现任河源数码港科技有限公司董事长兼总裁、香港大学经管学院深圳校友会会长、中山大学国际金融学院金融专业硕士及校外导师等。',
          },
          {
            title: '7、申海龙（西安）',
            content:
              '申海龙（西安），1964年3月11日出生，中共党员，1983年11月7日应征入伍在兰州军区舟桥第九十团服现役，1985年9月至1987年7月在西安陆军学院后勤培训学校学习，1987年7月至1998年11月在西安陆军学院通信训练大队服现役，1998年11月从部队转业到陕西省肿瘤医院工作至今，现任陕西省肿瘤医院后勤保障部主任正科，高级经济师。在部队因工作成绩突出荣立4次三等功，2021年被西安市人力资源和社会保障局评为“2009年度西安市医疗保险先进个人”；2018年被陕西省卫生厅评为在“改善医院环境提升医疗服务”专项行动中荣获“优质服务”。',
          },
          {
            title: '8、申海龙',
            content:
              '申海龙，1972年10月1日出生，1989年3月入伍，1991年7月加入中国共产党，大学本科学历，学士学位。1992年9月解放军大连陆军学院学员，2004年9月解放军理工大学土木工程专业学员。1994年7月解放军大连医学高等专科学校任区队长、参谋、副队长、队长等职。2007年2月解放军大连疗养院军务科科长（副团职），2013年3月中国人民解放军黑龙江省军区双鸭山军分区四方台区人武部部长（正团职，上校军衔）、区人大代表、常委。曾荣立三等功3次，多次被评为先进个人。',
          },
          {
            title: '9、申海雷',
            content:
              '申海雷，1982年4月7日出生，2001年12月入伍，2003年6月入党，大学本科学历，学士学位，现任大连市公安局二级警长。2001年12月入伍至三十九集团军一一六师二营炮兵连，2003年6月解放军陆军航空兵学院学员，2006年7月三十九集团军工兵团历任排长、装备处助理员、指导员、军运油料股股长等职。曾荣立三等功2次，多次被评为中俄联合军事演习先进个人、机关干部标兵等。2018年12月任大连市公安局二级警长。',
          },
          {
            title: '10、申荣真',
            content:
              '申荣真，女，1975年5月出生，1997年7月毕业于山东省泰山医学院，本科学历，学士学位，无党派人士,聊城市第十三届政协委员。1998年6月在冠县人民医院儿科参加工作，2005年12月晋升主治医师，2015年5月晋升副主任医师，2021年1月晋升主任医师，自2012年10月开始担任科主任职务。2012年10月获聊城市科技进步奖一项，2013年6月获国家实用新型专利《小儿体温计》一项；2019年12月被山东省卫生保健协会儿童危重症专家委员会委员；2021年5月被选为山东省医学会儿科基层学组委会委员。冠县应急专家。',
          },
          {
            title: '11、申法峰',
            content:
              '申法峰，1979年出生，1999年5月加入中共党员，大学学历，1994年至1997年就读于冠县一中，1997年参军，2000年考入中国人民武装警察部队学院，2003年毕业，现任德州市消防救援支队政治部主任，副县级。',
          },
        ],
      },
      {
        title: '三、收录申氏家族名士的说明',
        content:
          '收录的三条原则，经2022年3月6日宗亲会会议通过，对符合原则之一者，由本人或亲属将简历、工作政绩以及个人获得荣誉称号等汇集成文，于2022年3月21日前报至各支，后报至相坡收集。',
      },
    ],
  },
  {
    title: '申氏宗亲会参会人员',
    content:
      '申耀之 申景高 申相坡 申书桥 申爱华\n申景宪 申相春 申相松 申贵银 申贵民\n申海军 申海臣 申学献 申大勇',
  },
  {
    title: '申氏家族解放后任职的村党支部书记',
    list: [
      {
        title: '申怀顶',
        content:
          '申怀顶，1920年5月20日生，1941年5月加入中国共产党，1948年10月任村党支部书记，直到1982年9月份因年老多病，自愿向上级党组织提出辞职申请。他在任村党支部书记其间，时时、处处以一个党员的标准严格要求自己，任劳任怨、克己奉公、平等待人，积极带领全村广大人民群众参加土改运动和社会主义建设工作，得到了上级党委和全村广大人民群众的好评。于1992年3月22月病故，享年72岁。',
      },
      {
        title: '申耀之',
        content:
          '申耀之，1970年10月应征入伍，1974年5月加入中国共产党，历任战士、军械员兼文书，班长、党支部委员。他在部队授连嘉奖两次、营嘉奖1次。1977年1月，他复员后在程村联小任教员，1982年9月到2003年3月任村委会主任、党支部书记兼主任。13年来，出色的完成上级交给的各项任务。特别是在新村规划建设中，坚持原则，不怕困难；在修建村北南北路时，费尽周折，付出很大精力。\n\n1986年他受到县委、政府三等功奖励；1988年评为县优秀共产党员。',
      },
      {
        title: '申相坡',
        content:
          '申相坡 ，1968年6月10日生，2001年6月加入中国共产党，曾在冠县化肥厂、冠县酒厂上班，1997年任冠县交警大队协警员。2000年6月他当选村民委员会委员，而后任会计、副书记。2003年3月他被组织任命为村党支部书记至今。2019年他被县委任命为享受副科级待遇。\n\n在20余年的村工作中，围绕经济发展、乡村振兴，进行产业结构调整，组织村民外出学习技术，帮助村民栽植果树1000余棵、建大棚20余座，人均纯收入增加到10000余元。大力强化环境卫生及基础设施建设，把街道修成柏油道、水泥路，两侧栽绿化树200余棵、安装路灯60余盏，改造电路，新上变压器2台，安装监控、配备环卫工，村容村貌焕然一新。',
      },
    ],
  },
  {
    title: '申氏家族功名榜',
    list: [
      {
        content:
          '增广生讳麟祥字待清\n邑痒生讳麟趾字振子\n希敬字君选邑太学生\n太学生希思字绍伋\n太学生希有字仿若\n太学生希闵字德潜\n太学生希孔字鲁宗\n千总讳怀诗字可以\n怀智字濬哲候选例授修职郎\n武庠生怀圣字恩普\n怀堂字升高邑候选衞千总\n耀先字光楣邑文庠生',
      },
    ],
  },
  {
    title: '申氏家族族规',
    list: [
      {
        align: 'center',
        content:
          '终生勤奋好学，惜时寸金光阴，\n立志报国成才，浩然正气无邪。\n治家行孝尽悌，节俭朴素淡泊，\n教子身先垂范，切莫任其娇奢。\n做人诚信堂正，耐劳立德持家，\n攒钱聚财有道，远离吃喝嫖赌。\n做事谦逊认真，遵纪守法执着，\n不做荫下娇宠，自力更生建业。\n处世为善和睦，谦让理解友爱，\n夫妻恩爱专一，阖家幸福美满。',
      },
    ],
  },
  {
    title: '申氏家族传承武术',
    list: [
      {
        content:
          '申氏家族历代有习武的习惯，传承至今已有三百多年的历史。族人擅长武术，尤其精通六合大枪。据长辈口传，盛于十世冠甲、冠行。当年在冠县、东昌府难逢敌手，且打破行规，广纳门徒，授艺无私，传德有望。冠县境内徒弟来自：李芦村、苏胡町、玉庄、韩吕庄、岳庄、贾六庄、开河头、杨马庄、曹里村、杨皇城等村庄。东昌府武馆教头王恒玉、李丙正前来申小屯拜师学艺，并在民国二十五年全省大枪比赛获第三名。\n\n历史流传下来有：拳、枪、大刀、单刀。',
      },
      {
        title: '一、拳术类',
        content: '单人拳：六步（合）拳、侧（大）红拳、小红拳\n\n双人拳：杠捣把撕溜捶',
      },
      {
        title: '二、兵器类',
        content:
          '单人兵器：小花枪、四门斗大刀、七节鞭、单刀\n\n双人兵器：六合大枪、大刀擒枪、树梢子擒枪、缠丝杆子。目前还存有枪谱。',
      },
    ],
  },
  {
    title: '老族谱史料转载',
    list: [
      {
        title: '（一）申小屯史料记载',
        list: [
          {
            title: '1、始祖墓',
            content:
              '原文\n始祖及二世祖墓在屯正南偏东，第三条东西路南，南北地，闻亦亥山巳向，惜代远年湮，次序莫辨，故不便绘图俟后，惟当随时修筑，勿令湮没于荒烟蔓草，则三尺崇封，尚可识水木本源耳，愿同此谱者及后世子孙共知之。',
            source: [
              {
                content: '十三世孙耀麟谨志',
              },
            ],
          },
          {
            content:
              '注释\n一世始祖名廷方，字君聘，生长子尽仁，次子尽义。始祖及二世祖墓，在村子的正南偏东第三条东西向的路的路南的山上亥山巳向的方位，可惜年代久远，不便绘图了，以后应时常修缮，不令它(们)埋没于荒山野草之中，定期地把坟加高加大，让后代有可以祭拜祖先的地方而不忘记自己的本源。希望族谱上的亲人和后世子孙能了解我的心愿。',
          },
          {
            title: '2、皇帝圣旨',
            content:
              '奉天承运，皇帝制曰：资父事君，臣子笃匪，躬之谊作，忠以孝国家，宏锡类之仁尔。申希孔乃候选卫千总申怀堂之父，善积于身，祥开厥后，教子着义方之训，传家裕堂杨之遗，兹以尔子遵例急公封尔，为奉政大夫锡之。勅命于戏，殊荣必逮于所亲宠命用光夫有子，钦兹优渥长茈忠勤。\n\n制曰：奉职在公嘉教劳之有自推恩将毋宜锡类之尔，侯氏乃候选卫千总申怀堂之母，壶范宜家夙协承筐之媺，母仪诏谷，载昭画获之芳，兹以尔子遵例急公封尔为宜人于戏，彰淑德于不瑕式荣象服膺宠命之有赫益贲徽音。',
          },
          {
            title: '3、三位名人',
            content:
              '公讳希孔字鲁宗，邑太学生，白平成家，行悉义举，如文王之既勤，有耿光之余烈，如在信之节俭，有素丝之遗风。于咸丰年间沐吾皇恩，进京捐职，由寒士而入太学生，处世以仁让，教子以义方，子孙能承其训自不难昌盛于后云。',
            source: [
              {
                content: '族孙耀德谨志',
              },
            ],
          },
          {
            content:
              '公讳希敬字君选，邑太学生。弓马熟娴，武艺精通。虽未获武魁之选，亦有将才之能。好结交天下之士，当世咸仰其芳名。谈笑尽皆是鸿儒，往来应无一白丁。可以救人之患难，可以除村之恶风。念功德之无量，实振振而有声。思去世之未几，谁不共慕生平。神飘飘以飞扬，应亦在天而有灵。子孙知之而则效，因以福禄而无穷。见云雷之广闻兮，观盛德之所营。临清泉之长流兮，欣在昔之英风。仰春风之和穆兮，应亦唏嘘而有情。休矣美矣，惠人无疆。福佑我同姓兮，普救四方。同天地之规量兮，齐日月之辉光。常逍遥于物外兮，列仙班于上苍。愿子孙之昌盛兮，乐终古而未央。\n\n公讳希思字绍伋，邑太学生，持家有法，勤俭是尚，奉先祖之成业，荷本朝之厚恩，由白衣而入太学生，善积于身，祥开厥后，教子有义方之训，传家裕堂構之，遗子孙相守，宜世世勿忘焉。',
            source: [
              {
                content: '族孙耀麟谨志',
              },
            ],
          },
        ],
      },
      {
        title: '（二）郭胡町申氏史料记载',
        list: [
          {
            title: '1、申氏家谱序',
            content:
              '盖闻有明德者百世其昌，故五帝三王之世虽代远年湮，其谱系犹历历可考，尧有安安之德，以亲其族自能臻于变之，隆文有翼翼之德，以敦其族于以衍螽斯之处此何以故哉，盖必积德累仁而后族频繁多也故，凡我族姓之人能恤孤怜贫敬老慈幼，行时时之方便济人利世，不但子孙昌盛，更可照耀谱牒，于祖宗有光矣，倘知此而世世相守，不惟先人之名号，可传于后世，则谱之所以为谱者，不更可知其义也耶。',
            source: [
              {
                content: '光绪二十三年岁次丁酉仲春之月',
              },
              {
                content: '十三世孙耀德、耀麟敬立',
              },
              {
                content: '公元一九八三年正月初抄于小屯申氏家谱',
              },
              {
                content: '十三世为政、十四世景堂、景珠初修',
              },
            ],
          },
          {
            title: '2、郭胡町申氏宗族记事（节录）',
            content:
              '本族祖九世佩玉由申小屯来郭胡町落户身下两枝，长讳坟于申小屯，次讳坟于郭胡町村西，先祖九世到十四世景字历六代。',
            source: [
              {
                content: '公元一九八三年正月初敬修',
              },
              {
                content: '公元二零零二年转抄',
              },
            ],
          },
        ],
      },
    ],
  },
  {
    title: '捐资筑路碑记',
    list: [
      {
        content:
          '筑路修桥，造福百姓，功在当今，利在千秋。全体村民积极响应党支部、村委会发展经济，改变农村面貌的号召，纷纷自愿捐资筑路，展示了我村民众齐奔小康、共同致富的决心与热忱。本村在外公职的贤达之士慷慨解囊，鼎力相助。政界申景高、军界申相峰等在筹划、运作、融资、捐款方面做出了重大贡献。他们报效国家，造福乡里的功德之举，令乡亲父老无不为之感动。全村共修筑了“一纵两横”公路2700米，出色地完成了“村村通”工程，彻底结束了我村没有柏油路的历史。为嘉其德行，光启后人，特立此碑以记之，望全体村民永享安康，共创福祉。',
        source: [
          {
            content: '申小屯党支部村委会',
          },
          {
            content: '2006年12月立',
          },
        ],
      },
    ],
  },
  {
    title: '申氏家族筑路捐款名单',
    list: [
      {
        tableKeys: ['姓名', '捐款'],
        table: [
          {
            姓名: '申相锋',
            捐款: '壹万元',
          },
          {
            姓名: '申相坤',
            捐款: '伍仟元',
          },
          {
            姓名: '申景高',
            捐款: '贰仟元',
          },
          {
            姓名: '申怀录',
            捐款: '壹仟元',
          },
          {
            姓名: '申耀柱',
            捐款: '壹仟元',
          },
          {
            姓名: '申耀青',
            捐款: '壹仟元',
          },
          {
            姓名: '申耀强',
            捐款: '壹仟元',
          },
          {
            姓名: '申景军',
            捐款: '壹仟元（冠县）',
          },
          {
            姓名: '申相忠',
            捐款: '壹仟元',
          },
          {
            姓名: '申相军',
            捐款: '壹仟元（聊城）',
          },
          {
            姓名: '申相刚',
            捐款: '壹仟元',
          },
          {
            姓名: '申文利',
            捐款: '陆佰元',
          },
          {
            姓名: '申爱国',
            捐款: '陆佰元',
          },
          {
            姓名: '申相宾',
            捐款: '陆佰元（申子宾）',
          },
          {
            姓名: '申大勇',
            捐款: '陆佰元',
          },
          {
            姓名: '申海龙',
            捐款: '伍佰元（西安）',
          },
          {
            姓名: '申海臣',
            捐款: '伍佰元',
          },
          {
            姓名: '申海强',
            捐款: '伍佰元（村七队）',
          },
          {
            姓名: '申怀忠',
            捐款: '肆佰元',
          },
          {
            姓名: '申相勇',
            捐款: '肆佰元',
          },
          {
            姓名: '申海林',
            捐款: '肆佰元（冠县）',
          },
          {
            姓名: '申耀俭',
            捐款: '叁佰元',
          },
          {
            姓名: '申山华',
            捐款: '叁佰元',
          },
          {
            姓名: '申景全',
            捐款: '叁佰元',
          },
          {
            姓名: '申景阔',
            捐款: '叁佰元',
          },
          {
            姓名: '申景广',
            捐款: '叁佰元',
          },
          {
            姓名: '申景卓',
            捐款: '叁佰元',
          },
          {
            姓名: '申相合',
            捐款: '叁佰元',
          },
          {
            姓名: '申相坡',
            捐款: '叁佰元',
          },
          {
            姓名: '申相印',
            捐款: '叁佰元',
          },
          {
            姓名: '申相珍',
            捐款: '叁佰元',
          },
          {
            姓名: '申相虎',
            捐款: '叁佰元',
          },
          {
            姓名: '申海庆',
            捐款: '叁佰元',
          },
          {
            姓名: '申海军',
            捐款: '叁佰元',
          },
          {
            姓名: '申学芳',
            捐款: '叁佰元',
          },
          {
            姓名: '申景宪',
            捐款: '贰佰元',
          },
          {
            姓名: '申相国',
            捐款: '贰佰元（村四队）',
          },
          {
            姓名: '申英华',
            捐款: '壹佰元',
          },
          {
            姓名: '申庆华',
            捐款: '壹佰元',
          },
          {
            姓名: '申爱华',
            捐款: '壹佰元',
          },
          {
            姓名: '申景辉',
            捐款: '壹佰元',
          },
          {
            姓名: '申相武',
            捐款: '壹佰元',
          },
          {
            姓名: '申墨臣',
            捐款: '壹佰元',
          },
          {
            姓名: '申墨坡',
            捐款: '壹佰元',
          },
          {
            姓名: '申墨宽',
            捐款: '壹佰元',
          },
          {
            姓名: '申海忠',
            捐款: '壹佰元',
          },
          {
            姓名: '申墨超',
            捐款: '壹佰元',
          },
        ],
        // source: [
        //   {
        //     content: '共计47人',
        //   },
        // ],
      },
    ],
  },
  {
    title: '申氏家族修谱捐款名单',
    list: [
      {
        tableKeys: ['姓名', '捐款'],
        table: [
          {
            姓名: '申耀之',
            捐款: '800元',
          },
          {
            姓名: '申景高',
            捐款: '1000元',
          },
          {
            姓名: '申爱华',
            捐款: '800元',
          },
          {
            姓名: '申景宪',
            捐款: '800元',
          },
          {
            姓名: '申相坡',
            捐款: '1000元',
          },
          {
            姓名: '申相春',
            捐款: '1000元',
          },
          {
            姓名: '申相松',
            捐款: '800元',
          },
          {
            姓名: '申贵民',
            捐款: '800元',
          },
          {
            姓名: '申书桥（申墨军）',
            捐款: '1000元',
          },
          {
            姓名: '申海军',
            捐款: '800元',
          },
          {
            姓名: '申海臣',
            捐款: '1000元',
          },
          {
            姓名: '申学献',
            捐款: '1000元',
          },
          {
            姓名: '申大勇',
            捐款: '2000元',
          },
        ],
      },
    ],
  },
  {
    title: '申小屯申氏辈份韵歌',
    list: [
      {
        content:
          '鉴于申小屯申氏十九世后，辈分用字已不统一，为减少混乱，存本求正。遵循辈分选字应避免冲犯祖辈；文理通畅，容易记忆；字义悠远，能够较好地表达后代对祖上尊敬、赞美，前辈对后昆鼓励、期望的原则。特聘请中华诗词学会会员、中国楹联学会会员、中国散文学会会员、山东省作家协会会员、聊城作家协会顾问、冠县《百川》杂志主编、全国先进工作者高福林先生，为我们申小屯申氏十九世（沐）字辈以下二十一辈中间用字提出建议。',
      },
      {
        title: '前二十辈',
        content: '廷尽俊万天，光麟兰培冠，\n希怀耀景相，海子庆沐先。',
      },
      {
        title: '续二十辈',
        content: '知中论孟正，礼书易秋春，\n威严道成善，明德敬维新。',
      },
      {
        content:
          '该续辈的首句包涵《四书》，二句包涵《五经》，三四句取自《大学》：“大学之道，在明明德；古之欲明明德于天下者，先治其国，欲治其国者，先齐其家；欲齐其家者，先修其身；欲修其身者，先正其心；欲正其心者，先诚其意；欲诚其意者，先致其知，致知在格物。物格而后知至，知至而后意诚，意诚而后心正，心正而后身修，身修而后家齐，家齐而后国治，国治而后天下平。自天子以至于庶人，故皆应以修身为本。楚书曰：“楚国无以为宝，惟善以为宝。”',
        source: [
          {
            content: ' 2021年9月',
          },
        ],
      },
    ],
  },
  {
    title: '郭胡疃申氏辈份韵歌',
    list: [
      {
        content:
          '本族祖九世佩玉由申小屯来郭胡町落户身下两枝，长讳坟于申小屯，次讳坟于郭胡町村西，先祖九世到十四世景字历六代祖有诗一首，令子孙以诗文题名，全诗四句，二十字可供二十代提名。',
      },
      {
        content: '景向前贤法，开通后世人。\n家众从吾教，作责自本身。',
      },
      {
        content: '后续人十五世向孟、向明、向伦、向荣、向文、向端、向杰',
        source: [
          {
            content: '公元一九八三年正月初敬修',
          },
          {
            content: '公元二零零二年转抄',
          },
          {
            content:
              '复修转抄人\n十五世向文、向俭、向坦、向杰、向如\n十六世贵芳、贵增、贵银、贵钦\n十七世延河',
          },
          {
            content: '公元二零零二年十二月二十八日',
          },
        ],
      },
    ],
  },
  {
    title: '申小屯村概况',
    list: [
      {
        content:
          '申小屯村位于桑阿镇西5公里，新二干渠南岸。居落呈南北不规则长方形，东西2条主街，南北1条主街。\n\n据申、孔两姓家谱记载，明洪武年间(1368~1398年)，申、孔两姓从山西洪洞县迁此立村，初名于园，后被群匪血洗，幸存者北移1华里，重建家园，因户丁大减，申姓居多，故名申小屯。清道光十一年(1831年)版、1934年版《冠县志》均载“申小屯”。\n\n全村379户，1341人，汉族，有申、陈、韩、孔、王、刘、李、苏、孟、曹姓。耕地2273亩，沙壤平地，井浇田。主产小麦、玉米、棉花、花生等，有大棚蔬菜和苹果园。民营企业有面粉厂、木材加工厂、商店等，有卫生室1处。',
        source: [
          {
            content: '摘录于《冠县地名志》',
          },
        ],
      },
    ],
  },
  {
    title: '后 记',
    list: [
      {
        content:
          '盛世修志、望族列谱。我申氏族谱历经近一年的创修，终于付梓成册，这是我族一大盛事，也是缅怀祖先、启发后人的又一壮举，望家人要珍惜该族谱，常学常念以发扬光大。\n\n创修族谱实属不易，虽有微信、抖音、邮箱等现代媒体传送，电子化程度较高，但大家在寻访考证、收集整理、撰写核对等环节上还是冥思苦想，忙碌奔波、不知疲倦，悉心把握每一环节，力争交出优秀答卷。该族谱在传承中有提升，在编辑中有进步，为激励后辈，多出人才，快育才俊，附录里详细介绍了为族人增光添彩的烈士、英雄、将军、名士等，使他们的事迹世世相传，代代向往。\n\n自修谱以来，全族人都满怀热忱，尤其申氏宗亲会成员，历尽周折，各尽所能，不仅务工耗时还主动捐款，提供经费，在此深表谢意。同时对中华诗词学会会员、中国散文学会会员、全国先进工作者、聊城作家协会顾问、三善斋主高福林先生应邀撰序特以致谢。\n\n为延续修谱的优良传统，深切期盼族人每隔十年或二十年修订一次，不断充实延伸，传承更新，添加子孙，壮我族力。因创修族谱工作量大、涉及面广，虽然大家已殚精竭虑，但漏误难免，不足之处请予谅解，并期望祈阅此谱的人勘正，以作再修时救过补阙。',
        source: [
          {
            content: '十四世孙 景高',
          },
          {
            content: '2022年2月',
          },
        ],
      },
    ],
  },
];
